# Задача: Калькулятор ИМТ
# 1. Запроси у пользователя вес (кг) и рост (м)
# 2. Посчитай ИМТ = вес / рост**2
# 3. Выведи результат с пояснением:
#    <18.5 — недостаток, 18.5-25 — норма, >25 — избыток
try:
    weight = float(input('Введите ваш вес в кг: '))
    height = float(input('Введите ваш рост в м: '))

    if not (0 < weight < 300) or not (0 < height < 3):
        raise ValueError('Некорректные значения')

    imt = weight / height ** 2

    if imt < 18.5:
        category = 'недостаточная масса'
    elif 18.5 <= imt < 25:
        category = 'норма'
    elif 25 <= imt < 30:
        category = 'избыточная масса'
    else:
        category = 'ожирение'
    print(f'ИМТ: {round(imt, 2)} — {category}')

except ValueError:
    print('❌ Ошибка: введите корректные числовые значения!')
except KeyboardInterrupt:
    print('\n👋 Прервано пользователем')